Revit 2027 API
Metal.MetalPerforationsCenter Property
 The property labeled "Center Spacing" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetalPerforationsCenter { get; }
Public Shared ReadOnly Property MetalPerforationsCenter As String
	Get
public:
static property String^ MetalPerforationsCenter {
	String^ get ();
}
static member MetalPerforationsCenter : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" with a minimum of "0.0001".
See Also
Reference
Metal Class
Autodesk.Revit.DB.Visual Namespace